kordets/ExpressLRS/src/src/esp32/wifi_logger.cpp
#if WIFI_LOGGER || WIFI_UPDATER || ESP_NOW

#include "wifi_logger.h"

#include <Arduino.h>
#include <freertos/ringbuf.h>
#include <ESPmDNS.h>
#if WIFI_MANAGER
#include <WiFiManager.h>
#endif
#include <WebSocketsServer.h>
#include <WebServer.h>
#include <HTTPUpdate.h>

#include "msp.h"
#include "platform.h"
#include "targets.h"
#include "debug_elrs.h"

#define QUEUE_SIZE 256

#ifndef WIFI_AP_SSID
#define WIFI_AP_SSID "ExpressLRS AP"
#endif
#ifndef WIFI_AP_PSK
#define WIFI_AP_PSK "expresslrs"
#endif

#ifndef WIFI_TIMEOUT
#define WIFI_TIMEOUT 60 // default to 1min
#endif

MDNSResponder mdns;
WebServer server(80);
#if WIFI_LOGGER && !WIFI_UPDATER
WebSocketsServer webSocket = WebSocketsServer(81);
#define WEBSOCKET_BROADCASET(text) webSocket.broadcastTXT(text)
#define WEBSOCKET_SEND(sock, text) webSocket.sendTXT(sock, text)
#else
#define WEBSOCKET_BROADCASET(text) Serial.println(text)
#define WEBSOCKET_SEND(sock, text) Serial.println(text)
#endif

/*************************************************************************/

static uint8_t DRAM_ATTR settings_rate = 1;
static uint8_t DRAM_ATTR settings_power = 4;
static uint8_t DRAM_ATTR settings_power_max = 8;
static uint8_t DRAM_ATTR settings_tlm = 7;
static uint8_t DRAM_ATTR settings_region = 0;

MSP DRAM_ATTR msp_handler;
mspPacket_t DRAM_ATTR msp_out;

/*************************************************************************/

static QueueHandle_t DRAM_ATTR receive_queue = NULL;
static QueueHandle_t DRAM_ATTR send_queue = NULL;

class CtrlSerialPrivate: public CtrlSerial
{
public:
  void set_queue_rx(QueueHandle_t q) {
    p_queue_rx = q;
  }
  void set_queue_tx(QueueHandle_t q) {
    p_queue_tx = q;
  }

  size_t available(void) {
    if (p_queue_rx == NULL)
      return 0;
    return uxQueueMessagesWaiting(p_queue_rx);
  }
  uint8_t read(void) {
    uint8_t out;
    if (p_queue_rx && xQueueReceive(p_queue_rx, &out, (TickType_t)1)) {
      return out;
    }
    return 0;
  }

  void write(uint8_t * buffer, size_t size) {
    if (p_queue_tx == NULL)
      return;
    while (size--)
      xQueueSend(p_queue_tx, (void *)buffer++, (TickType_t)0);
  }

private:
  QueueHandle_t p_queue_rx = NULL;
  QueueHandle_t p_queue_tx = NULL;
};

CtrlSerialPrivate DRAM_ATTR ctrl_msp_send;
CtrlSerialPrivate DRAM_ATTR ctrl_msp_receive;
CtrlSerial& ctrl_serial = ctrl_msp_send;

/******************* ESP-NOW *********************/
#if ESP_NOW
#include <esp_now.h>

void esp_now_recv_cb(const uint8_t *mac_addr, const uint8_t *data, int data_len)
{
  /* No data or peer is unknown => ignore */
  if (!data_len || !esp_now_is_peer_exist(mac_addr))
    return;

  Serial.println("ESP NOW CB called!");

  // Push data into ctrl queue, ERLS task will process it
  // Note: accept only correctly formatted MSP packets
  ctrl_msp_receive.write((uint8_t*)data, data_len);
}

void init_esp_now(void)
{
  Serial.print("Initialize ESP-NOW... ");

  wifi_mode_t mode = WiFi.getMode();
  if (mode == WIFI_MODE_NULL) {
    Serial.println("(WiFi not enabled, set APSTA mode) ");
    WiFi.mode(WIFI_MODE_APSTA); // Start wifi
  }

  esp_now_init();
  esp_now_register_recv_cb(esp_now_recv_cb);

#ifdef ESP_NOW_PEERS
  //wifi_interface_t ifidx =
  //  (mode == WIFI_MODE_STA) ? ESP_IF_WIFI_STA : ESP_IF_WIFI_AP;
  esp_now_peer_info_t peer_info = {
    .peer_addr = {0},
    .lmk = {0},
    .channel = ((mode != WIFI_MODE_STA) ? ESP_NOW_CHANNEL : 0),
    //.ifidx = ifidx,
    .ifidx = ESP_IF_WIFI_STA,
    .encrypt = false,
    .priv = NULL
  };
  uint8_t peers[][ESP_NOW_ETH_ALEN] = ESP_NOW_PEERS;
  uint8_t num_peers = sizeof(peers) / ESP_NOW_ETH_ALEN;
  for (uint8_t iter = 0; iter < num_peers; iter++) {
    memcpy(peer_info.peer_addr, peers[iter], ESP_NOW_ETH_ALEN);
    esp_now_del_peer(peers[iter]);
    esp_now_add_peer(&peer_info);
  }
#endif // ESP_NOW_PEERS

  Serial.println("DONE");
}

void deinit_esp_now(void)
{
  Serial.print("Stop ESP-NOW... ");

#ifdef ESP_NOW_PEERS
  uint8_t peers[][ESP_NOW_ETH_ALEN] = ESP_NOW_PEERS;
  uint8_t const num_peers = sizeof(peers) / ESP_NOW_ETH_ALEN;
  for (uint8_t iter = 0; iter < num_peers; iter++) {
    esp_now_del_peer(peers[iter]);
  }
#endif // ESP_NOW_PEERS

  esp_now_deinit();
  Serial.println("DONE");
}
#endif // ESP_NOW

/*************************************************************************/

String DRAM_ATTR inputString = "";
//String my_ipaddress_info_str = "NA";

static const char PROGMEM GO_BACK[] = R"rawliteral(
<!DOCTYPE html>
<html>
    <head>
    </head>
    <body>
        <script>
            javascript:history.back();
        </script>
    </body>
</html>
)rawliteral";

#if WIFI_UPDATER

static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <meta name="viewport" content="width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
    <title>ESP update</title>
    <style>
        body {
            background-color: #1E1E1E;
            font-family: Arial, Helvetica, Sans-Serif;
            Color: #69cbf7;
        }

        textarea {
            background-color: #252525;
            Color: #C5C5C5;
            border-radius: 5px;
            border: none;
        }
    </style>
</head>
<body>
  <center>
    <div>
      <form method='POST' action='/update' enctype='multipart/form-data'>
          Update Firmware:
          <input type='file' accept='.bin' name='firmware'>
          <input type='submit' value='Upload and Flash'>
      </form>
    </div>

  </center>
</body>
</html>
)rawliteral";

#elif WIFI_LOGGER
static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>

<head>
    <meta name="viewport" content="width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
    <title>TX Log Messages</title>
    <style>
        body {
            background-color: #1E1E1E;
            font-family: Arial, Helvetica, Sans-Serif;
            Color: #69cbf7;
        }

        textarea {
            background-color: #252525;
            Color: #C5C5C5;
            border-radius: 5px;
            border: none;
        }
    </style>
    <script>
        var websock;
        function start() {
            document.getElementById("logField").scrollTop = document.getElementById("logField").scrollHeight;
            websock = new WebSocket('ws://' + window.location.hostname + ':81/');
            websock.onopen = function (evt) {
              console.log('websock open');
            };
            websock.onclose = function(e) {
              console.log('Socket is closed. Reconnect will be attempted in 1 second.', e.reason);
              setTimeout(function() {
                start();
              }, 1000);
            };
            websock.onerror = function (evt) { console.log(evt); };
            websock.onmessage = function (evt) {
                //console.log(evt);
                var text = evt.data;
                if (text.startsWith("ELRS_setting_")) {
                  var res = text.replace("ELRS_setting_", "");
                  res = res.split("=");
                  setting_set(res[0], res[1]);
                } else {
                  var logger = document.getElementById("logField");
                  var autoscroll = document.getElementById("autoscroll").checked;
                  var date = new Date();
                  var n=new Date(date.getTime() - (date.getTimezoneOffset() * 60000)).toISOString();
                  logger.value += n + ' ' + text + '\n';
                  if (autoscroll)
                    logger.scrollTop = logger.scrollHeight;
                }
            };
        }

        function saveTextAsFile() {
            var textToWrite = document.getElementById('logField').value;
            var textFileAsBlob = new Blob([textToWrite], { type: 'text/plain' });

            var downloadLink = document.createElement("a");
            downloadLink.download = "tx_log.txt";
            downloadLink.innerHTML = "Download File";
            if (window.webkitURL != null) {
                // Chrome allows the link to be clicked without actually adding it to the DOM.
                downloadLink.href = window.webkitURL.createObjectURL(textFileAsBlob);
            } else {
                // Firefox requires the link to be added to the DOM before it can be clicked.
                downloadLink.href = window.URL.createObjectURL(textFileAsBlob);
                downloadLink.onclick = destroyClickedElement;
                downloadLink.style.display = "none";
                document.body.appendChild(downloadLink);
            }

