kordets/ExpressLRS/src/src/esp32/wifi_logger.cpp
void handleRoot()
{
#if WIFI_LOGGER || WIFI_UPDATER
  server.send_P(200, "text/html", INDEX_HTML);
#else
  server.send_P(200, "text/html", "...Internal ERROR!!");
#endif
}

void handleMacAddress()
{
  uint8_t primaryChan;
  wifi_second_chan_t secondChan;
  esp_wifi_get_channel(&primaryChan, &secondChan);
  (void)secondChan;

  String message = "WiFi STA MAC: ";
  message += WiFi.macAddress();
  message += "\n  - channel in use: ";
  message += primaryChan;
  message += "\n  - mode: ";
  message += (uint8_t)WiFi.getMode();
  message += "\n\nWiFi SoftAP MAC: ";
  message += WiFi.softAPmacAddress();
  message += "\n  - IP: ";
  message += WiFi.softAPIP().toString();
  message += "\n";
  server.send(200, "text/plain", message);
}

void handleNotFound()
{
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
}

uint32_t DRAM_ATTR wifi_setup_ok = false;
uint32_t DRAM_ATTR servers_started = false;

void web_services_start(void)
{
  /* Check if WiFi is set up and server are not started */
  if (servers_started || !wifi_setup_ok)
    return;

  servers_started = true;

  if (mdns.begin("elrs_tx"))
  {
    mdns.addService("http", "tcp", 80);
    mdns.addService("ws", "tcp", 81);
  }

  server.on("/", handleRoot);
  server.on("/return", sendReturn);
  server.on("/mac", handleMacAddress);

  /* handling uploading firmware file (OTA update) */
  server.on("/update", HTTP_POST, []() {
    server.sendHeader("Connection", "close");
    //server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
    if (Update.hasError()) {
      //server.sendHeader("Connection", "close");
      server.send(200, "text/plain", "OTA flash failed!");
    } else {
      server.send(200, "text/html", "<HEAD><meta http-equiv=\"refresh\" content=\"0;url=/\"></HEAD>");
    }
    ESP.restart();
  }, []() {
    HTTPUpload& upload = server.upload();
    if (upload.status == UPLOAD_FILE_START) {
      platform_radio_force_stop();
      Serial.printf("Update: %s\n", upload.filename.c_str());
      if (!Update.begin(UPDATE_SIZE_UNKNOWN)) { //start with max available size
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_WRITE) {
      /* flashing firmware to ESP*/
      if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
        Update.printError(Serial);
      }
    } else if (upload.status == UPLOAD_FILE_END) {
      if (Update.end(true)) { //true to set the size to the current progress
        Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      } else {
        Update.printError(Serial);
      }
    }
  });

  server.onNotFound(handleRoot);
  server.begin();

#if WIFI_LOGGER && !WIFI_UPDATER
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
#endif // WIFI_LOGGER
}

void wifi_setup(void)
{
  IPAddress my_ip;
#if defined(WIFI_SSID) && defined(WIFI_PSK)
  uint32_t iter, jter, timeout;
#endif

  /* Check if WiFi already set up */
  if (wifi_setup_ok)
    return;

  wifi_setup_ok = true;

#if defined(WIFI_SSID) && defined(WIFI_PSK)
  Serial.print("Connecting to wifi ");

  timeout = WIFI_TIMEOUT * 2;
  timeout /= 10;

  for (iter = 0; (iter < timeout) && (WiFi.status() != WL_CONNECTED); iter++) {
    if (WiFi.status() != WL_CONNECTED) {
      WiFi.persistent(false);
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      WiFi.mode(WIFI_STA);
      WiFi.begin(WIFI_SSID, WIFI_PSK);

      jter = 0;
      while (++jter <= 50) {
        vTaskDelay(100);
        if (WiFi.status() == WL_CONNECTED) {
          break;
        } else if ((jter % 10) == 0) {
          Serial.print(".");
        }
      }
    }
  }
  if (WiFi.status() == WL_CONNECTED) {
    my_ip = WiFi.localIP();
    Serial.println(" CONNECTED!");
  } else
#elif WIFI_MANAGER
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(WIFI_AP_SSID" ESP32 TX")) {
    // AP found, connected
    my_ip = WiFi.localIP();
  }
  else
#endif // WIFI_MANAGER
  {
    Serial.println(" FAILED! Starting AP...");
    // No WiFi found, start access point
    WiFi.mode(WIFI_AP);
    WiFi.softAP(WIFI_AP_SSID" ESP32 TX", WIFI_AP_PSK);
    my_ip = WiFi.softAPIP();
  }

  //my_ipaddress_info_str = "[L] My IP address = ";
  //my_ipaddress_info_str += my_ip.toString();

  Serial.print("Connect to http://elrs_tx.local or http://");
  Serial.println(my_ip);
}

int serialEvent(QueueHandle_t queue)
{
  char inChar;
  // process inputs
  uint32_t numBytes = uxQueueMessagesWaiting(queue);
  while (numBytes--)
  {
    if (xQueueReceive(queue, &inChar, (TickType_t)1)) {
      if (msp_handler.processReceivedByte(inChar)) {
        WEBSOCKET_BROADCASET("[L] MSP received");
        // msp fully received
        mspPacket_t &msp_in = msp_handler.getPacket();
        if (msp_in.type == MSP_PACKET_V1_ELRS) {
          switch (msp_in.function) {
            case ELRS_INT_MSP_PARAMS: {
              WEBSOCKET_BROADCASET("[L] ELRS params resp");
              uint8_t * payload = (uint8_t*)msp_in.payload;
              settings_rate = payload[0];
              settings_tlm = payload[1];
              settings_power = payload[2];
              settings_power_max = payload[3];
              settings_region = payload[4];
#if WIFI_LOGGER && !WIFI_UPDATER
              SettingsSendWS(-1); // send to all clients
#endif // WIFI_LOGGER && !WIFI_UPDATER
#if ESP_NOW
              esp_now_send(NULL, (uint8_t*)msp_in.payload, msp_in.payloadSize);
#endif
              break;
            }
          };
        }
        msp_handler.markPacketFree();

      } else if (!msp_handler.mspOngoing()) {
        if (inChar == '\r') {
          continue;
        } else if (inChar == '\n') {
          return 0;
        }
        inputString += inChar;
      }
    } else {
      break; // no more input data
    }
  }
  return -1;
}

void wifi_loop(QueueHandle_t queue)
{
  if (0 <= serialEvent(queue)) {
    WEBSOCKET_BROADCASET(inputString);
    inputString = "";
  }

  server.handleClient();
#if WIFI_LOGGER && !WIFI_UPDATER
  webSocket.loop();
#endif // WIFI_LOGGER
}

