kordets/ExpressLRS/src/src/esp32/wifi_logger.cpp
TaskHandle_t wifiTask = NULL;

void httpsTask(void *pvParameters)
{
  QueueHandle_t queue = (QueueHandle_t)pvParameters;
  TickType_t xLastWakeTime;
  const TickType_t xFrequency = (20 / portTICK_RATE_MS);

  Serial.println("HTTP task started...");

  xLastWakeTime = xTaskGetTickCount();
  for(;;) {
    wifi_loop(queue);
    // wait for next cycle
    vTaskDelayUntil(&xLastWakeTime, xFrequency);
  }

  /* delete the input queue */
  receive_queue = NULL;
  vQueueDelete(queue);

  /* and output queue */
  queue = send_queue;
  send_queue = NULL;
  vQueueDelete(queue);

  /* remove task */
  vTaskDelete( NULL );
  wifiTask = NULL;
  Serial.println("HTTP task exit");
}

void wifi_init(void)
{
  if (wifiTask != NULL) {
    Serial.println("HTTP task already started");
    return;
  }

  if (receive_queue == NULL)
    receive_queue = xQueueCreate(QUEUE_SIZE, sizeof(uint8_t));
  if (send_queue == NULL)
    send_queue = xQueueCreate(QUEUE_SIZE, sizeof(uint8_t));

  ctrl_msp_send.set_queue_rx(send_queue);
  ctrl_msp_send.set_queue_tx(receive_queue);

  ctrl_msp_receive.set_queue_rx(receive_queue);
  ctrl_msp_receive.set_queue_tx(send_queue);

#if WIFI_LOGGER && WIFI_LOGGER_AUTO_START && !WIFI_UPDATER
  wifi_setup();
  web_services_start();
#endif
#if ESP_NOW
  init_esp_now();
#endif

  xTaskCreatePinnedToCore(
    httpsTask,              // Function to implement the task
    "wifiTask",             // Name of the task
    4096,                   // Stack size in bytes
    receive_queue,          // Task input parameter
    (tskIDLE_PRIORITY + 1), // Priority of the task
    &wifiTask, 0);
  Serial.println("HTTP task started");
}

void wifi_start(void)
{
  Serial.println("== Starting WiFi services ==");
#if ESP_NOW
  deinit_esp_now();
#endif
  wifi_init();
  wifi_setup();
  web_services_start();
#if ESP_NOW
  init_esp_now();
#endif
  Serial.println("WiFi services started!");
}

void wifi_stop(void)
{
}

/*************************************************************************/

#if WIFI_LOGGER && !WIFI_UPDATER
int DebugSerial::available(void)
{
  if (receive_queue == NULL)
    return 0;
  return uxQueueMessagesWaiting(receive_queue);
}

int DebugSerial::availableForWrite(void)
{
  if (receive_queue == NULL)
    return 0;
  return uxQueueSpacesAvailable(receive_queue);
}

int DebugSerial::peek(void)
{
  return 0;
}

int DebugSerial::read(void)
{
  uint8_t out;
  if (receive_queue && xQueueReceive(receive_queue, &out, (TickType_t)1)) {
    return out;
  }
  return 0;
}

void DebugSerial::flush(void)
{
  /* do nothing */
}

size_t DebugSerial::write(uint8_t data)
{
  return write(&data, 1);
}

size_t DebugSerial::write(const uint8_t *buffer, size_t size)
{
  size_t num = 0;
  if (receive_queue == NULL)
    return 0;
  while (size--) {
    xQueueSend(receive_queue, (void *)buffer++, (TickType_t)0);
    num++;
  }
  return num;
}

DebugSerial wifi_logger_serial;
#endif // WIFI_LOGGER

#endif // WIFI_LOGGER || WIFI_UPDATER
